MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ15/mcu.h
#define PCR                           0x00780000      // FlexBus hold cycles before FlexBus can release bus to NFC or to IDLE
#define MCC                           0x7FFF8000      // NFC hold cycle in case FlexBus request while NFC is granted


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

#define ADC3ALTTRGEN                  0x80000000      // ADC3 alternate trigger enable
#define ADC3PRETRGSEL                 0xC0000000      // ADC3 pre-trigger select
#define ADC3TRGSEL                    0x1F0000000      // ADC3 trigger select
#define ADC2ALTTRGEN                  0x00800000      // ADC2 alternate trigger enable
#define ADC2PRETRGSEL                 0x00C00000      // ADC2 pre-trigger select
#define ADC2TRGSEL                    0x01F00000      // ADC2 trigger select
#define ADC1ALTTRGEN                  0x00008000      // ADC1 alternate trigger enable
#define ADC1PRETRGSEL                 0x0000C000      // ADC1 pre-trigger select
#define ADC1TRGSEL                    0x0001F000      // ADC1 trigger select
#define ADC0ALTTRGEN                  0x00000080      // ADC0 alternate trigger enable
#define ADC0PRETRGSEL                 0x000000C0      // ADC0 pre-trigger select
#define ADC0TRGSEL                    0x000001F0      // ADC0 trigger select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SDID register.
//
//*****************************************************************************

#define REVID                         0x00078000      // Device revision number
#define FAMID                         0x000001C0      // Kinetis family identification
#define PINID                         0x00000078      // Pincount identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC1 register.
//
//*****************************************************************************

#define UART5                         0x00000800      // UART5 clock gate control
#define UART4                         0x00000400      // UART4 clock gate control
#define OSC1                          0x00000020      // OSC1 clock gate control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC2 register.
//
//*****************************************************************************

#define DAC1                          0x00002000      // 12BDAC1 clock gate control
#define DAC0                          0x00001000      // 12BDAC0 clock gate control
#define ENET                          0x00000001      // ENET clock gate control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC3 register.
//
//*****************************************************************************

#define ADC3                          0x10000000      // ADC3 clock gate control
#define ADC1                          0x08000000      // ADC1 clock gate control
#define FTM3                          0x02000000      // FTM3 clock gate control
#define FTM2                          0x01000000      // FTM2 clock gate control
#define ESDHC                         0x00020000      // ESDHC clock gate control
#define SAI1                          0x00008000      // SAI1 clock gate control
#define DSPI2                         0x00001000      // DSPI2 clock gate control
#define NFC                           0x00000100      // NFC clock gate control
#define FLEXCAN1                      0x00000010      // FlexCAN1 clock gate control
#define RNGA                          0x00000001      // RNGA clock gate control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define LLWU                          0x10000000      // LLWU Clock Gate Control
#define VREF                          0x00100000      // VREF clock gate control
#define CMP                           0x00080000      // Comparator clock gate control
#define USBFS                         0x00040000      // USB FS clock gate control
#define UART3                         0x00002000      // UART3 clock gate control
#define UART2                         0x00001000      // UART2 clock gate control
#define UART1                         0x00000800      // UART1 clock gate control
#define UART0                         0x00000400      // UART0 clock gate control
#define IIC1                          0x00000080      // IIC1 clock gate control
#define IIC0                          0x00000040      // IIC0 clock gate control
#define Reserved                      0x00000020      // Reserved
#define Reserved                      0x00000010      // Reserved
#define Reserved                      0x00000008      // Reserved
#define CMT                           0x00000004      // CMT clock gate control
#define EWM                           0x00000002      // EWM clock gate control
#define Reserved                      0x00000001      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

#define PORTF                         0x00040000      // PORTF clock gate control
#define PORTE                         0x00020000      // PORTE clock gate control
#define PORTD                         0x00010000      // PORTD clock gate control
#define PORTC                         0x00008000      // PORTC clock gate control
#define PORTB                         0x00004000      // PORTB clock gate control
#define PORTA                         0x00002000      // PORTA clock gate control
#define TSI                           0x00000020      // TSI clock gate control
#define Reserved                      0x00000002      // Reserved
#define LPTIMER                       0x00000001      // LPTMR clock gate control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC6 register.
//
//*****************************************************************************

#define RTC                           0x20000000      // RTC clock gate control
#define ADC2                          0x10000000      // ADC2 clock gate control
#define ADC0                          0x08000000      // ADC0 clock gate control
#define FTM1                          0x02000000      // FTM1 clock gate control
#define FTM0                          0x01000000      // FTM0 clock gate control
#define PIT                           0x00800000      // PIT clock gate control
#define PDB                           0x00400000      // PDB clock gate control
#define USBDCD                        0x00200000      // USB DCD clock gate control
#define USBHS                         0x00100000      // USBHS clock gate control
#define CRC                           0x00040000      // CRC clock gate control
#define SAI0                          0x00008000      // SAI0 clock gate control
#define DSPI1                         0x00002000      // DSPI1 clock gate control
#define DSPI0                         0x00001000      // DSPI0 clock gate control
#define FLEXCAN0                      0x00000010      // FlexCAN0 clock gate control
#define DMAMUX1                       0x00000004      // DMAMUX1 clock gate control
#define DMAMUX0                       0x00000002      // DMAMUX0 clock gate control
#define Reserved                      0x00000001      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC7 register.
//
//*****************************************************************************

