MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ15/mcu.h
#define COUNT                         0x7FFF8000      // Number of frames transmitted with multiple collisions


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_DEF register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with deferral delay


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_LCOL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with late collision


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_EXCOL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with excessive collisions


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_MACERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with transmit FIFO underrun


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_CSERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with carrier sense error ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_SQE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with SQE error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_FDXFC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of flow-control pause frames transmitted


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_OCTETS_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Octet count for frames transmitted without error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_PACKETS register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of packets received


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_BC_PKT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive broadcast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_MC_PKT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive multicast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_CRC_ALIGN register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets with CRC or align error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_UNDERSIZE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets with less than 64 bytes and good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_OVERSIZE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets greater than MAX_FL and good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_FRAG register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets with less than 64 bytes and bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_JAB register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets greater than MAX_FL and bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P64 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 64-byte receive packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P65TO127 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 65- to 127-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P128TO255 register.
//
//*****************************************************************************

