MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ15/mcu.h
#define COUNT                         0x7FFF8000      // Number of 128- to 255-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P256TO511 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 256- to 511-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P512TO1023 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 512- to 1023-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P1024TO2047 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 1024- to 2047-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P_GTE2048 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of greater-than-2048-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_OCTETS register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Number of receive octets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_DROP register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Frame count


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_FRAME_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received OK


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_CRC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received with CRC error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_ALIGN register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received with alignment error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_MACERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Receive FIFO overflow count


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_FDXFC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of flow-control pause frames received


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_OCTETS_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Number of octets for frames received without error


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CONTROL register.
//
//*****************************************************************************

#define SR                            0x02000000      // Software Reset
#define START                         0x01000000      // Start Change Detection Sequence
#define IE                            0x00010000      // Interrupt Enable
#define IF                            0x00000100      // Interrupt Flag
#define IACK                          0x00000001      // Interrupt Acknowledge


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CLOCK register.
//
//*****************************************************************************

#define CLOCK_SPEED                   0x001FF800      // Numerical Value of Clock Speed in Binary
#define CLOCK_UNIT                    0x00000001      // Unit of Measurement Encoding for Clock Speed


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_STATUS register.
//
//*****************************************************************************

#define ACTIVE                        0x00400000      // Active Status Indicator
#define TO                            0x00200000      // Timeout Flag
#define ERR                           0x00100000      // Error Flag
#define SEQ_STAT                      0x00180000      // Charger Detection Sequence Status
#define SEQ_RES                       0x00060000      // Charger Detection Sequence Results


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER0 register.
//
//*****************************************************************************

#define TSEQ_INIT                     0x7FE000000      // Sequence Initiation Time
#define TUNITCON                      0x007FF800      // Unit Connection Timer Elapse


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER1 register.
//
//*****************************************************************************

#define TDCD_DBNC                     0x7FE000000      // Time Period to Debounce D+ Signal
#define TVDPSRC_ON                    0x0007FE00      // Time Period Comparator Enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_TIMER2 register.
//
//*****************************************************************************

