MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FX512VLQ15/mcu.h
#define BUFLM                         0x7FFFFFFF80000000      // Buffer MB i Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_IFLAG1 register.
//
//*****************************************************************************

#define BUF31TO8I                     0x7FFFFF80000000      // Buffer MBi Interrupt
#define BUF7I                         0x00000080      // Buffer MB7 Interrupt Or "Rx FIFO Overflow"
#define BUF6I                         0x00000040      // Buffer MB6 Interrupt Or "Rx FIFO Warning"
#define BUF5I                         0x00000020      // Buffer MB5 Interrupt Or "Frames available in Rx FIFO"
#define BUF4TO1I                      0x000000F0      // Buffer MB i Interrupt Or "reserved"
#define BUF0I                         0x00000001      // Buffer MB0 Interrupt Or "reserved"


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_CTRL2 register.
//
//*****************************************************************************

#define WRMFRZ                        0x10000000      // Write-Access To Memory In Freeze Mode
#define RFFN                          0x78000000      // Number Of Rx FIFO Filters
#define TASD                          0x0F800000      // Tx Arbitration Start Delay
#define MRP                           0x00040000      // Mailboxes Reception Priority
#define RRS                           0x00020000      // Remote Request Storing
#define EACEN                         0x00010000      // Entire Frame Arbitration Field Comparison Enable For Rx Mailboxes


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_ESR2 register.
//
//*****************************************************************************

#define LPTM                          0x1FC00000      // Lowest Priority Tx Mailbox
#define VPS                           0x00004000      // Valid Priority Status
#define IMB                           0x00002000      // Inactive Mailbox


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_CRCR register.
//
//*****************************************************************************

#define MBCRC                         0x1FC00000      // CRC Mailbox
#define Reserved                      0x00008000      // 
#define TXCRC                         0x1FFFC000      // CRC Transmitted


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXFGMASK register.
//
//*****************************************************************************

#define FGM[31:0]                     0x7FFFFFFF80000000      // Rx FIFO Global Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXFIR register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFF80000000      // 
#define IDHIT                         0x0001FF00      // Identifier Acceptance Filter Hit Indicator ::


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXIMRn register.
//
//*****************************************************************************

#define MI[31:0]                      0x7FFFFFFF80000000      // Individual Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the Message_buffer_structure register.
//
//*****************************************************************************

#define CODE                          0x00000078      // Message Buffer Code
#define SRR                           0x60000000      // Substitute Remote Request
#define IDE                           0x08000000      // ID Extended Bit
#define RTR                           0x04000000      // Remote Transmission Request
#define DLC                           0x07800000      // Length of Data in Bytes
#define PRIO                          0x00038000      // Local priority


//*****************************************************************************
//
// The following are defines for the bit fields in the Rx_FIFO_structure register.
//
//*****************************************************************************

#define SRR                           0x780000000      // Substitute Remote Request
#define IDE                           0x08000000      // ID Extended Bit
#define RTR                           0x04000000      // Remote Transmission Request
#define DLC                           0x07800000      // Length of Data in Bytes


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_DSADDR register.
//
//*****************************************************************************

#define DSADDR                        0x1FFFFFFF80000000      // DMA System Address


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_BLKATTR register.
//
//*****************************************************************************

#define BLKCNT                        0x7FFF80000000      // Blocks Count For Current Transfer
#define BLKSIZE                       0x01FFF000      // Transfer Block Size


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_CMDARG register.
//
//*****************************************************************************

